Stress-Testing/load-test.yaml
config:
  target: "http://localhost:3000/api"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 200
    - duration: 60
      arrivalRate: 200
      rampTo: 1000




  processor: "./load-test-help.js"  # Include the JavaScript file
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
  - name: "Get Product By Id"
    flow:
      - function: "logProductId"
      - get:
          url: "/products/{{ productId }}"