Stress-Testing/load-test.yaml
config:
  target: "http://localhost:3000/api"
  phases:
    - duration: 60
      arrivalRate: 20
      maxUsers: 1000
    - duration: 840
      arrivalRate: 40
      maxUsers: 1000


  processor: "./load-test-help.js"  # Include the JavaScript file
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
  - name: "Get Product By Id"
    weight: 3
    flow:
    - loop:
      - function: "logProductId"
      - get:
          url: "/products/{{ productId }}"
      count: 200

  - name: "Get Product Styles"
    weight: 3
    flow:
    - loop:
      - function: "logProductId"
      - get:
          url: "/products/{{ productId }}/styles"
      count: 200

  - name: "Get Related Products"
    weight: 3
    flow:
    - loop:
      - function: "logProductId"
      - get:
          url: "/products/{{ productId }}/related"
      count: 200

  - name: "Get Products"
    weight: 1
    flow:
    - loop:
      - function: "logProductId"
      - get:
          url: "/products/?count={{ count }}&page={{ page }}"
      - think: 3
      count: 5